#!/bin/bash
echo ""
echo "███████ ██ ███    ███ ██████  ██      ███████     ████████ ███████ ██      ███████  ██████  ██████   █████  ███    ███     ██████   ██████  ████████ "
echo "██      ██ ████  ████ ██   ██ ██      ██             ██    ██      ██      ██      ██       ██   ██ ██   ██ ████  ████     ██   ██ ██    ██    ██    "
echo "███████ ██ ██ ████ ██ ██████  ██      █████          ██    █████   ██      █████   ██   ███ ██████  ███████ ██ ████ ██     ██████  ██    ██    ██    "
echo "     ██ ██ ██  ██  ██ ██      ██      ██             ██    ██      ██      ██      ██    ██ ██   ██ ██   ██ ██  ██  ██     ██   ██ ██    ██    ██    "
echo "███████ ██ ██      ██ ██      ███████ ███████        ██    ███████ ███████ ███████  ██████  ██   ██ ██   ██ ██      ██     ██████   ██████     ██    "
echo ""

if [[ $1 == "--setup" ]]; then
    echo "Настрока бота"
    echo "Введите токен вашего бота: "
    read BOT_TOKEN
    echo "Введите id вашей группы: "
    read CHAT_ID
    echo "TOKEN=$BOT_TOKEN" > .env
    echo "CHAT_ID=$CHAT_ID" >> .env

elif [[ $1 == "--start" ]]; then
    echo "Запуск бота"
    python3 main.py

elif [[ $1 == "--help" ]]; then
    echo "Справка"
    echo "Настройка бота   --setup"
    echo "Запуск бота      --start"

else
    echo "Неверный параметр для получения справки введите --help"
fi
